<script setup>

</script>

<template>
<div class="container">
  <h1>Немного о нашей комании</h1>
  <p>Всем людям постоянно нужна недвижимость - для того, чтобы жить, работать или отдыхать. Каждый из нас<br> хоть один раз в жизни решал вопрос по покупке или продаже жилья. И перед каждым вставал вопрос: стоит ли<br> обращаться к риэлтору? Кто-то принимал решение действовать самостоятельно, кто-то обращался к специалистам<br> по недвижимости. Какое решение из них правильное - это другой вопрос.</p>
  <div>
    <h1>01</h1>
    <h3>Своя база</h3>
    <p>В моей базе более 20 000 предложений по продаже недвижимости в Москве</p>
  </div>
  <div>
    <h1>02</h1>
    <h3>Скорость работы</h3>
    <p>Подберу Вам выгодные варианты недвижимости в течении нескольких часов с момента отправки заявки</p>
  </div>
  <div>
    <h1>03</h1>
    <h3>Гарантия результата</h3>
    <p>Продам Вашу квартиру за месяц и максимально дорого</p>
  </div>
  <div>
    <h1>04</h1>
    <h3>Сопровождение</h3>
    <p>Обеспечу полную юридическую чистоту сделки</p>
  </div>

</div>
</template>

<style scoped>

.container {
  background-color: #333; /* Серый цвет фона */
  padding: 20px;
  display: grid;
  grid-template-columns: repeat(2, 1fr); /* Два столбца */
  gap: 20px; /* Расстояние между столбцами */
}

.container > div {
  background-color: #fff; /* Белый цвет фона для блоков */
  padding: 10px;
  border-radius: 5px;
}

.container > div > h1 {
  border-bottom: 2px solid #fbfbfb; /* Подчеркивание заголовка */
  display: inline-block;
  margin-bottom: 10px;
}

.container > div > p {
  margin-bottom: 10px;
  color: white;
}

.container h1 {
  color: white;
}

.container p {
  color: white;
}

. {
  color:  #ff6b6b;
}
</style>
